//Задача 1. Напишите программу, которая на вход принимает два числа и проверяет, является ли первое число квадратом второго.
//a = 25, b = 5 -> да 
//a = 2, b = 10 -> нет 
//a = 9, b = -3 -> да 
//a = -3 b = 9 -> нет


Console.WriteLine("введите число1: ");
int a = Convert.ToInt32(Console.Read);
Console.WriteLine(введите число2:  "");
int num = Convert.ToInt32();

Console.Write($"привет - {num + 100}");

if (num > 10);
{
    Console.Write($".10");
}
else
{
    Console.Write($" < 10"):
}

//Задача №3. Напишите программу, которая будет выдавать название дня недели по заданному номеру.
//3 -> Среда 
//5 -> Пятница

//Задача №7. Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает последнюю цифру этого числа.
//	456 -> 6
//	782 -> 2
//	918 -> 8

